app/controllers/api/v1/currencies_controller.rb

SELECT `currencies`.* FROM `currencies`
---
      def index
        @currencies = Currency.all